Documents/СправкаОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СправкаОДоходах</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправокОДоходах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СовокупныйДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоОблагаемое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОсновное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСовместительство</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоЗП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоПрочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Алименты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КалендарныеДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВзносы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходНДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаемоеЕСВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаемоеЕСВПредел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходВоенныйСбор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВоенныйСбор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходЗаВычетомНДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛПрочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаВзносов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ИсчисленныйНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ИсчисленныйНДФЛ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доход</Name>
					<Comment>Объект обложения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьготПоНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛьгот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УвеличеннаяСтавка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходПолный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыСправокОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыСправокОДоходах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Произвольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Соцстрах2023</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия2015</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенсия2015</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыИНалоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Соцстрах2015</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СправкаОДоходах/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Подсистема "Управление доступом"

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "Сотрудник");
	
КонецПроцедуры

// Подсистема "Управление доступом"

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Автозаполнение() Экспорт
	
	Отказ = Ложь;
	
    Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан сотрудник';uk='Не вказаний співробітник'"), ЭтотОбъект, "Сотрудник", "Объект", Отказ);
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указана организация';uk='Не зазначена організація'"), ЭтотОбъект, "Организация", "Объект", Отказ);
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНач) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указана дата начала периода';uk='Не вказана дата початку періоду'"), ЭтотОбъект, "ДатаНач", "Объект", Отказ);
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаКон) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указана дата окончания периода';uk='Не вказана дата закінчення періоду'"), ЭтотОбъект, "ДатаКон", "Объект", Отказ);
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если ВидСправки = Перечисления.ВидыСправокОДоходах.Произвольная Тогда
		АвтозаполнениеПроизвольная();
	ИначеЕсли ВидСправки = Перечисления.ВидыСправокОДоходах.ДоходыИНалоги Тогда	
		АвтозаполнениеДоходыИНалоги();
	ИначеЕсли ВидСправки = Перечисления.ВидыСправокОДоходах.Субсидия2015 Тогда	
		АвтозаполнениеСубсидия2015();
	ИначеЕсли ВидСправки = Перечисления.ВидыСправокОДоходах.Соцстрах2015 Тогда	
		АвтозаполнениеСоцстрах2015();
	ИначеЕсли ВидСправки = Перечисления.ВидыСправокОДоходах.Соцстрах2023 Тогда	
		АвтозаполнениеСоцстрах2023();
	ИначеЕсли ВидСправки = Перечисления.ВидыСправокОДоходах.Пенсия2015 Тогда	
		АвтозаполнениеПенсия2015();	
	КонецЕсли;	

	Если Доходы.Количество() = 0 Тогда
		
		Сообщить(НСтр("ru='Не обнаружены данные для записи в табличную часть документа.';uk='Не виявлені дані для запису в табличну частину документа.'"), СтатусСообщения.Важное)
		
	КонецЕсли;
	
	//Дозаполним периоды
	ДатаТек = НачалоМесяца(ДатаНач);
	Пока ДатаТек <= ДатаКон Цикл
		СтрокаТЧ = Доходы.Найти(ДатаТек,"Период");
		Если СтрокаТЧ = Неопределено Тогда
			НС = Доходы.Добавить();
			НС.Период = ДатаТек;
		КонецЕсли;
		ДатаТек = ДобавитьМесяц(ДатаТек,1);
	КонецЦикла;
	Доходы.Сортировать("Период");

КонецПроцедуры //  Автозаполнение

Процедура АвтозаполнениеПроизвольная()
	Доходы.Очистить();
	ДоходыТекстЗапроса = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	СУММА(ВЫБОР 
	   |		КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено) 
	   |		ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
	   |		ИНАЧЕ 0
	   |	КОНЕЦ) КАК Начислено,
	   |	СУММА(ВЫБОР 
	   |		КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
	   |		ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
	   |		ИНАЧЕ 0
	   |	КОНЕЦ) КАК Удержано,
	   |	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) КАК Период
	   |ИЗ
	   |	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	   |ГДЕ
	   |    НачисленияУдержанияПоСотрудникам.ФизическоеЛицо = &парамФизическоеЛицо 
	   |    И НачисленияУдержанияПоСотрудникам.Организация = &парамОрганизация
   	   |    И НачисленияУдержанияПоСотрудникам.Период МЕЖДУ &парамДатаНач И &парамДатаКон
	   |СГРУППИРОВАТЬ ПО
	   |    НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) 
	   |";

	Запрос = Новый Запрос(ДоходыТекстЗапроса);
	
	Запрос.УстановитьПараметр("парамФизическоеЛицо", Сотрудник.ФизическоеЛицо);
	Запрос.УстановитьПараметр("парамДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("парамДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамВзносы", Перечисления.СпособыРасчетаВзносов.Взносы);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Доходы.Добавить();
		
		Строка.Период			= Выборка.Период;
		Строка.СовокупныйДоход	= Выборка.Начислено;
		Строка.Удержания		= Выборка.Удержано;
		Строка.СуммаКВыплате	= Выборка.Начислено - Выборка.Удержано;
	КонецЦикла;
	
КонецПроцедуры // АвтозаполнениеПроизвольная

Процедура АвтозаполнениеДоходыИНалоги()
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамФизическоеЛицо", Сотрудник.ФизическоеЛицо);
	Запрос.УстановитьПараметр("парамДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("парамДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамВзносы", Перечисления.СпособыРасчетаВзносов.Взносы);

	ДоходыТекстЗапроса = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	НДФЛПоСотрудникам.Период КАК Период,
	   |	СУММА(НДФЛПоСотрудникам.НалогОборот) КАК НДФЛ,
	   |	СУММА(НДФЛПоСотрудникам.ДоходОборот) КАК ДоходНДФЛ,
	   |	0 КАК Выплачено,
	   |	0 КАК ДоходВоенныйСбор,
	   |	0 КАК ВоенныйСбор,
	   |	СУММА(НДФЛПоСотрудникам.ДоходОборот) - СУММА(НДФЛПоСотрудникам.НалогОборот) КАК ДоходЗаВычетомНДФЛ
	   |ПОМЕСТИТЬ ВТНачисленияИУдержания
	   |ИЗ
	   |	РегистрНакопления.ИсчисленныйНДФЛ.Обороты(&парамДатаНач, &парамДатаКон, Месяц, ФизическоеЛицо = &парамФизическоеЛицо И Организация.Ссылка = &парамОрганизация ) КАК НДФЛПоСотрудникам
	   |ГДЕ
	   |	НДФЛПоСотрудникам.КодДохода.ВидСтавкиРезидента <> ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.ВоенныйСбор)
	   |СГРУППИРОВАТЬ ПО
	   |	НДФЛПоСотрудникам.Период
	   |
	   |ОБЪЕДИНИТЬ ВСЕ
	   |
	   |ВЫБРАТЬ 
	   |	НДФЛПоСотрудникам.Период КАК Период,
	   |	0 КАК НДФЛ,
	   |	0 КАК ДоходНДФЛ,
	   |	0 КАК Выплачено,
	   |	НДФЛПоСотрудникам.ДоходОборот КАК ДоходВоенныйСбор,
	   |	НДФЛПоСотрудникам.НалогОборот КАК ВоенныйСбор,
	   |	0 КАК ДоходЗаВычетомНДФЛ
	   |ИЗ
	   |	РегистрНакопления.ИсчисленныйНДФЛ.Обороты(&парамДатаНач, &парамДатаКон, Месяц, ФизическоеЛицо = &парамФизическоеЛицо И Организация.Ссылка = &парамОрганизация ) КАК НДФЛПоСотрудникам
	   |ГДЕ
	   |	НДФЛПоСотрудникам.КодДохода.ВидСтавкиРезидента = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.ВоенныйСбор)
	   |
	   |ОБЪЕДИНИТЬ ВСЕ
	   |
	   |
	   |
	   |ВЫБРАТЬ
	   |	ВзаиморасчетыССотрудниками.ПериодВзаиморасчетов КАК Период,
	   |	0 КАК НДФЛ,
	   |	0 КАК ДоходНДФЛ,
	   |	ВзаиморасчетыССотрудниками.СуммаКВыплатеРасход КАК Выплачено,
   	   |	0,
	   |	0,
	   |	0
	   |ИЗ
	   |	РегистрНакопления.ЗарплатаКВыплате.Обороты(&парамДатаНач, &парамДатаКон, , ФизическоеЛицо = &парамФизическоеЛицо И Организация.Ссылка = &парамОрганизация И (ПериодВзаиморасчетов МЕЖДУ &парамДатаНач И &парамДатаКон)) КАК ВзаиморасчетыССотрудниками
	   |
	   |;
	   |
	   |ВЫБРАТЬ
	   |	СУММА(НачисленияИУдержания.НДФЛ) КАК НДФЛ,
	   |	СУММА(НачисленияИУдержания.ДоходНДФЛ) КАК ДоходНДФЛ,
	   |	СУММА(НачисленияИУдержания.Выплачено) КАК Выплачено,
	   |	НачисленияИУдержания.Период,
	   |	СУММА(НачисленияИУдержания.ДоходВоенныйСбор) КАК ДоходВоенныйСбор,
	   |	СУММА(НачисленияИУдержания.ВоенныйСбор) КАК ВоенныйСбор,
	   |	СУММА(НачисленияИУдержания.ДоходЗаВычетомНДФЛ) КАК ДоходЗаВычетомНДФЛ
	   |ИЗ                                                  
	   |	ВТНачисленияИУдержания КАК НачисленияИУдержания
	   |СГРУППИРОВАТЬ ПО
	   |	НачисленияИУдержания.Период
	   |";

	
	
	Запрос.Текст = ДоходыТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Колонки = Результат.Колонки;
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Доходы.Добавить();
		Строка.Период			= Выборка.Период;
		Строка.ДоходНДФЛ		= Выборка.ДоходНДФЛ;
		Строка.НДФЛ				= Выборка.НДФЛ;
		Строка.Выплачено		= Выборка.Выплачено;
		Строка.ДоходВоенныйСбор = Выборка.ДоходВоенныйСбор;
		Строка.ВоенныйСбор		= Выборка.ВоенныйСбор;
		Строка.ДоходЗаВычетомНДФЛ = Выборка.ДоходЗаВычетомНДФЛ;
		
	КонецЦикла;
	
КонецПроцедуры // АвтозаполнениеДоходыИНалоги

Процедура АвтозаполнениеСубсидия2015() Экспорт
	
	Доходы.Очистить();
	ДоходыТекстЗапроса = "
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |  НДФЛ.НалоговыйПериод КАК Период,
	 |  ВЫБОР 
	 |   КОГДА НДФЛ.КодДохода.СоответствуетОплатеТруда
	 |   ТОГДА НДФЛ.ДоходОборот 
	 |   ИНАЧЕ 0
	 |  КОНЕЦ КАК НачисленоЗП,
	 |  ВЫБОР 
	 |   КОГДА НДФЛ.КодДохода.СоответствуетОплатеТруда ИЛИ НДФЛ.КодДохода.ВидСтавкиРезидента = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.ВоенныйСбор)
	 |   ТОГДА 0 
	 |   ИНАЧЕ НДФЛ.ДоходОборот
	 |  КОНЕЦ КАК НачисленоПрочее,
	 |  ВЫБОР 
	 |   КОГДА НДФЛ.КодДохода.СоответствуетОплатеТруда
	 |   ТОГДА НДФЛ.НалогОборот 
	 |   ИНАЧЕ 0
	 |  КОНЕЦ КАК НДФЛ,
	 |  ВЫБОР 
	 |   КОГДА НДФЛ.КодДохода.СоответствуетОплатеТруда ИЛИ НДФЛ.КодДохода.ВидСтавкиРезидента = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.ВоенныйСбор)
	 |   ТОГДА 0 
	 |   ИНАЧЕ НДФЛ.НалогОборот
	 |  КОНЕЦ КАК НДФЛПрочее
	 |ПОМЕСТИТЬ ВТНДФЛ
	 |ИЗ РегистрНакопления.ИсчисленныйНДФЛ.Обороты(&парамДатаНач, &парамДатаКон, ,ФизическоеЛицо = &парамФизическоеЛицо И Организация.Ссылка = &парамОрганизация И НалоговыйПериод МЕЖДУ &парамДатаНач И &парамДатаКон) КАК НДФЛ
	 |;
	 |
	 |///////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
     |		Удержания.Период КАК Период,
     |		Удержания.СуммаОборот КАК Алименты
	 |ПОМЕСТИТЬ ВТАлименты
	 |ИЗ РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(&парамДатаНач, &парамДатаКон, Месяц,ФизическоеЛицо = &парамФизическоеЛицо И Организация.Ссылка = &парамОрганизация И НачислениеУдержание ССЫЛКА ПланВидоврасчета.Удержания) КАК Удержания
     |ГДЕ
	 |	Удержания.НачислениеУдержание.КатегорияУдержания = &парамАлименты
	 |;
	 |
	 |///////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВложенныйЗапрос.Период КАК Период,
     |	СУММА(ВложенныйЗапрос.НачисленоЗП+ВложенныйЗапрос.НачисленоПрочее) КАК СовокупныйДоход,
     |	СУММА(ВложенныйЗапрос.НачисленоЗП) КАК НачисленоЗП,
     |	СУММА(ВложенныйЗапрос.НачисленоПрочее) КАК НачисленоПрочее,
	 |	СУММА(ВложенныйЗапрос.НДФЛ) КАК НДФЛ,
     |	СУММА(ВложенныйЗапрос.НДФЛПрочее) КАК НДФЛПрочее,
	 |	СУММА(ВложенныйЗапрос.Алименты) КАК Алименты
     |ИЗ
     |	(ВЫБРАТЬ
     |  	ТаблицаНДФЛ.Период КАК Период,
	 |  	ТаблицаНДФЛ.НачисленоЗП КАК НачисленоЗП,
	 |  	ТаблицаНДФЛ.НачисленоПрочее КАК НачисленоПрочее,
	 |  	ТаблицаНДФЛ.НДФЛ КАК НДФЛ,
	 |  	ТаблицаНДФЛ.НДФЛПрочее КАК НДФЛПрочее,
	 |  	0 КАК Алименты
     |	 ИЗ ВТНДФЛ КАК ТаблицаНДФЛ
     |	
     |	 ОБЪЕДИНИТЬ ВСЕ
     |	
     |	ВЫБРАТЬ
     |		ТаблицаАлименты.Период,
     |		0,
	 |		0,
	 |		0,
	 |		0,
     |		ТаблицаАлименты.Алименты
     |	ИЗ ВТАлименты КАК ТаблицаАлименты
     |) КАК ВложенныйЗапрос
     |
     |СГРУППИРОВАТЬ ПО
     |	ВложенныйЗапрос.Период";
						 
	Запрос = Новый Запрос(ДоходыТекстЗапроса);
	
	Запрос.УстановитьПараметр("парамФизическоеЛицо", Сотрудник.ФизическоеЛицо);
	Запрос.УстановитьПараметр("парамДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("парамДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамАлименты", Перечисления.КатегорииУдержаний.ИсполнительныйЛист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Доходы.Загрузить(ТЗ);	
	
КонецПроцедуры //  Автозаполнение

Процедура АвтозаполнениеСоцстрах2015() Экспорт
	
	Доходы.Очистить();
	ДоходыТекстЗапроса = "
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |  НАЧАЛОПЕРИОДА(ЕСВ.НалоговыйПериод,МЕСЯЦ) КАК Период,
	 |  СУММА(
	 |   ВЫБОР
	 |    КОГДА  ЕСВ.СпособРасчета = &парамВзносы ТОГДА 0
	 |    ИНАЧЕ ЕСВ.БазаВзноса-ЕСВ.БазаДоначисление
	 |	 КОНЕЦ ) КАК РезультатВсего,
	 |  СУММА(
	 |   ВЫБОР
	 |    КОГДА  ЕСВ.СпособРасчета = &парамВзносы ТОГДА ЕСВ.Сумма
	 |    ИНАЧЕ 0
	 |	 КОНЕЦ ) КАК РезультатВзносы,
	 |  МАКСИМУМ(
	 |   ВЫБОР
	 |    КОГДА  ЕСВ.СпособРасчета = &парамВзносы ТОГДА ЕСВ.Ставка
	 |    ИНАЧЕ 0
	 |	 КОНЕЦ ) КАК СтавкаВзносов,
	 |  ЕСВ.ВидЕСВ КАК ВидЕСВ
	 |ПОМЕСТИТЬ ВТЕСВ
	 |ИЗ РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК ЕСВ
	 |ГДЕ
	 |	ЕСВ.ФизическоеЛицо = &парамФизическоеЛицо
     |	И ЕСВ.НалоговыйПериод МЕЖДУ &парамДатаНач И &парамДатаКон
     |	И ЕСВ.Организация = &парамОрганизация
	 |	И ЕСВ.ВидЕСВ НЕ В (&парамВидыЕСВНеВключая)
	 |СГРУППИРОВАТЬ ПО
	 |  НАЧАЛОПЕРИОДА(ЕСВ.НалоговыйПериод,МЕСЯЦ),
	 |  ЕСВ.ВидЕСВ
	 |;
	 |
	 |///////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
     |	ДанныеУчетаВремени.Месяц,
	 |	СУММА(ДанныеУчетаВремени.ОтработаноДнейКалендарных - ДанныеУчетаВремени.УчитываетсяДнейБолезниУходаЗаДетьми) КАК КалендарныеДниВсего
 	 |ПОМЕСТИТЬ ВТКалендарныеДни
	 |ИЗ
	 |	РегистрСведений.СведенияОВремениДляРасчетаСреднегоФCC КАК ДанныеУчетаВремени
	 |ГДЕ
	 |	ДанныеУчетаВремени.ФизическоеЛицо = &парамФизическоеЛицо
     |	И ДанныеУчетаВремени.Месяц МЕЖДУ &парамДатаНач И &парамДатаКон
     |	И ДанныеУчетаВремени.ГоловнаяОрганизация = &парамОрганизация
	 |СГРУППИРОВАТЬ ПО
	 |  ДанныеУчетаВремени.Месяц
	 |;
	 |
	 |///////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |   КалендарныеДни.Месяц КАК Период,
	 |   ВЫБОР
	 |		КОГДА ЕСТЬNULL(ЕСВ.ВидЕСВ,ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)) = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)
	 | 		ТОГДА ЕСТЬNULL(КалендарныеДни.КалендарныеДниВсего,0)
	 | 		ИНАЧЕ 0 
	 |	КОНЕЦ КАК КалендарныеДни,
	 |  ЕСТЬNULL(ЕСВ.РезультатВсего,0) КАК РезультатВсего,
	 |  ЕСТЬNULL(ЕСВ.РезультатВзносы,0)	КАК РезультатВзносы,
	 |  ЕСТЬNULL(ЕСВ.СтавкаВзносов,0)*100 КАК СтавкаВзносов
	 |
	 |ИЗ ВТКалендарныеДни КАК КалендарныеДни
	 |   ЛЕВОЕ СОЕДИНЕНИЕ ВТЕСВ КАК ЕСВ
	 |   ПО КалендарныеДни.Месяц = ЕСВ.Период
	 |УПОРЯДОЧИТЬ ПО
	 |  КалендарныеДни.Месяц, ЕСВ.ВидЕСВ
	 |
	 |";
						 
	Запрос = Новый Запрос(ДоходыТекстЗапроса);
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("парамФизическоеЛицо", Сотрудник.ФизическоеЛицо);
	Запрос.УстановитьПараметр("парамДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("парамДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамВзносы", Перечисления.СпособыРасчетаВзносов.Взносы);
	ВидыЕСВНеВключая = Новый Массив();
	ВидыЕСВНеВключая.Добавить(Перечисления.ВидыЕСВ.Больничные);
	ВидыЕСВНеВключая.Добавить(Перечисления.ВидыЕСВ.Декретные);
	ВидыЕСВНеВключая.Добавить(Перечисления.ВидыЕСВ.НачисленияМобилизованным);
	Запрос.УстановитьПараметр("парамВидыЕСВНеВключая", ВидыЕСВНеВключая);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Доходы.Загрузить(ТЗ);	
	
КонецПроцедуры //  Автозаполнение

Процедура АвтозаполнениеСоцстрах2023() Экспорт
	
	Доходы.Очистить();
	ДоходыТекстЗапроса = "
	 |ВЫБРАТЬ
     |	Начисления.Ссылка КАК ВидРасчета
	 |ПОМЕСТИТЬ ВТИсключаемыеВР
	 |ИЗ
     |	ПланВидовРасчета.Начисления КАК Начисления
	 |ГДЕ
     |	Начисления.ОбозначениеВТабелеУчетаРабочегоВремени.УважительнаяПричинаДляБольничных = ЛОЖЬ
     |	И Начисления.ИсключитьВремяПриРасчетеСреднегоЗаработкаФСС = ИСТИНА
     |	И Начисления.ПометкаУдаления = ЛОЖЬ
	 |;
	 |
	 |/////////////////////////////////////////////////////////////////////// 	 
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	 |	НАЧАЛОПЕРИОДА(ФПД.ПериодДействияНачало, МЕСЯЦ) КАК Период,
	 |	СУММА(РАЗНОСТЬДАТ(ФПД.ПериодДействияНачало, ФПД.ПериодДействияКонец, ДЕНЬ) + 1) КАК ДнейИсключить
	 |ПОМЕСТИТЬ ВТИнтервалыДляИсключенияФПД
	 |ИЗ
	 |	РегистрРасчета.Начисления.ФактическийПериодДействия(ГоловнаяОрганизация = &парамОрганизация И Сотрудник = &Сотрудник И ПериодДействия МЕЖДУ &парамДатаНач И &парамДатаКон) КАК ФПД
	 |  ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	 |  ВТИсключаемыеВР КАК ИсключаемыеВР
	 |  ПО ИсключаемыеВР.ВидРасчета = ФПД.ВидРасчета 
	 |
	 |СГРУППИРОВАТЬ ПО 
     |	НАЧАЛОПЕРИОДА(ФПД.ПериодДействияНачало, МЕСЯЦ)
	 |;
	 |
	 |/////////////////////////////////////////////////////////////////////// 	 
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |  НАЧАЛОПЕРИОДА(ЕСВ.НалоговыйПериод,МЕСЯЦ) КАК Период,
	 |  СУММА(
	 |   ВЫБОР
	 |    КОГДА  ЕСВ.СпособРасчета = &парамВзносы ТОГДА 0
	 |    ИНАЧЕ ЕСВ.БазаВзноса-ЕСВ.БазаДоначисление
	 |	 КОНЕЦ ) КАК РезультатВсего,
	 |  СУММА(
	 |   ВЫБОР
	 |    КОГДА  ЕСВ.СпособРасчета = &парамВзносы ТОГДА ЕСВ.Сумма
	 |    ИНАЧЕ 0
	 |	 КОНЕЦ ) КАК РезультатВзносы,
	 |  МАКСИМУМ(
	 |   ВЫБОР
	 |    КОГДА  ЕСВ.СпособРасчета = &парамВзносы ТОГДА ЕСВ.Ставка
	 |    ИНАЧЕ 0
	 |	 КОНЕЦ ) КАК СтавкаВзносов,
	 |  ЕСВ.ВидЕСВ КАК ВидЕСВ
	 |ПОМЕСТИТЬ ВТЕСВ
	 |ИЗ РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК ЕСВ
	 |ГДЕ
	 |	ЕСВ.ФизическоеЛицо = &парамФизическоеЛицо
     |	И ЕСВ.НалоговыйПериод МЕЖДУ &парамДатаНач И &парамДатаКон
     |	И ЕСВ.Организация = &парамОрганизация
	 |	И ЕСВ.ВидЕСВ НЕ В (&парамВидыЕСВНеВключая)
	 |СГРУППИРОВАТЬ ПО
	 |  НАЧАЛОПЕРИОДА(ЕСВ.НалоговыйПериод,МЕСЯЦ),
	 |  ЕСВ.ВидЕСВ
	 |;
	 |
	 |///////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
     |	ДанныеУчетаВремени.Месяц,
	 |	СУММА(ДанныеУчетаВремени.ОтработаноДнейКалендарных - ДанныеУчетаВремени.УчитываетсяДнейБолезниУходаЗаДетьми - ЕСТЬNULL(ИнтервалыДляИсключенияФПД.ДнейИсключить, 0)) КАК КалендарныеДниВсего
 	 |ПОМЕСТИТЬ ВТКалендарныеДни
	 |ИЗ
	 |	РегистрСведений.СведенияОВремениДляРасчетаСреднегоФCC КАК ДанныеУчетаВремени
	 |  ЛЕВОЕ СОЕДИНЕНИЕ
	 |  ВТИнтервалыДляИсключенияФПД КАК ИнтервалыДляИсключенияФПД
	 |	ПО ДанныеУчетаВремени.Месяц = ИнтервалыДляИсключенияФПД.Период 
	 |ГДЕ
	 |	ДанныеУчетаВремени.ФизическоеЛицо = &парамФизическоеЛицо
     |	И ДанныеУчетаВремени.Месяц МЕЖДУ &парамДатаНач И &парамДатаКон
     |	И ДанныеУчетаВремени.ГоловнаяОрганизация = &парамОрганизация
	 |СГРУППИРОВАТЬ ПО
	 |  ДанныеУчетаВремени.Месяц
	 |;
	 |
	 |///////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |   КалендарныеДни.Месяц КАК Период,
	 |   ВЫБОР
	 |		КОГДА ЕСТЬNULL(ЕСВ.ВидЕСВ,ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)) = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)
	 | 		ТОГДА ЕСТЬNULL(КалендарныеДни.КалендарныеДниВсего,0)
	 | 		ИНАЧЕ 0 
	 |	КОНЕЦ КАК КалендарныеДни,
	 |  ЕСТЬNULL(ЕСВ.РезультатВсего,0) КАК РезультатВсего,
	 |  ЕСТЬNULL(ЕСВ.РезультатВзносы,0)	КАК РезультатВзносы,
	 |  ЕСТЬNULL(ЕСВ.СтавкаВзносов,0)*100 КАК СтавкаВзносов
	 |
	 |ИЗ ВТКалендарныеДни КАК КалендарныеДни
	 |   ЛЕВОЕ СОЕДИНЕНИЕ ВТЕСВ КАК ЕСВ
	 |   ПО КалендарныеДни.Месяц = ЕСВ.Период
	 |УПОРЯДОЧИТЬ ПО
	 |  КалендарныеДни.Месяц, ЕСВ.ВидЕСВ
	 |
	 |";
						 
	Запрос = Новый Запрос(ДоходыТекстЗапроса);
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("парамФизическоеЛицо", Сотрудник.ФизическоеЛицо);
	Запрос.УстановитьПараметр("парамДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("парамДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамВзносы", Перечисления.СпособыРасчетаВзносов.Взносы);
	ВидыЕСВНеВключая = Новый Массив();
	ВидыЕСВНеВключая.Добавить(Перечисления.ВидыЕСВ.Больничные);
	ВидыЕСВНеВключая.Добавить(Перечисления.ВидыЕСВ.Декретные);
	ВидыЕСВНеВключая.Добавить(Перечисления.ВидыЕСВ.НачисленияМобилизованным);
	Запрос.УстановитьПараметр("парамВидыЕСВНеВключая", ВидыЕСВНеВключая);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Доходы.Загрузить(ТЗ);	
	
КонецПроцедуры //  Автозаполнение

Процедура АвтозаполнениеПенсия2015()
	
	Доходы.Очистить();
	ДоходыТекстЗапроса = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	ЕСВПоСотрудникам.Период КАК Период,
	   |	ЕСВПоСотрудникам.БазаОборот КАК БазаЕСВ,
	   |	ЕСВПоСотрудникам.БазаВзносаОборот КАК БазаВзносаЕСВ,
	   |	ЕСВПоСотрудникам.БазаДоначислениеОборот КАК БазаДоначисление
	   |ПОМЕСТИТЬ ВТНачисленияИУдержания	   
	   |ИЗ
	   |	РегистрНакопления.ИсчисленныеСтраховыеВзносы.Обороты(&парамДатаНач, &парамДатаКон, Месяц, ФизическоеЛицо = &парамФизическоеЛицо И Организация.Ссылка = &парамОрганизация И СпособРасчета = &парамВзносыФОТ И ВидЕСВ В (&парамСписокПенсия)) КАК ЕСВПоСотрудникам
	   |;
	   |
	   |ВЫБРАТЬ
	   |	СУММА(НачисленияИУдержания.БазаЕСВ) КАК ВсегоОблагаемое,
	   |	СУММА(НачисленияИУдержания.БазаВзносаЕСВ-НачисленияИУдержания.БазаДоначисление) КАК РезультатВсего,
	   |	НачисленияИУдержания.Период
	   |ИЗ
	   |	ВТНачисленияИУдержания КАК НачисленияИУдержания
	   |СГРУППИРОВАТЬ ПО
	   |	НачисленияИУдержания.Период
	   |";
	
	
	Запрос = Новый Запрос(ДоходыТекстЗапроса);
	
	Запрос.УстановитьПараметр("парамФизическоеЛицо", Сотрудник.ФизическоеЛицо);
	Запрос.УстановитьПараметр("парамДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("парамДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамВзносыФОТ", Перечисления.СпособыРасчетаВзносов.ВзносыФОТ);
	
	СписокПенсия = Новый Массив(4);
	СписокПенсия[0]=(Перечисления.ВидыЕСВ.ОсновнаяЗарплата);
	СписокПенсия[1]=(Перечисления.ВидыЕСВ.Больничные);
	СписокПенсия[2]=(Перечисления.ВидыЕСВ.Декретные);
	СписокПенсия[3]=(Перечисления.ВидыЕСВ.ПоДоговорамГПХ);
	Запрос.УстановитьПараметр("парамСписокПенсия", СписокПенсия);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Доходы.Загрузить(ТЗ);
	
КонецПроцедуры // АвтозаполнениеПенсия2015

#КонецЕсли
